# 1. Используем официальный легковесный образ Python
FROM python:3.12-alpine

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем файл с зависимостями
# Мы делаем это отдельным шагом, чтобы Docker кэшировал установку библиотек
COPY requirements.txt .

# 4. Устанавливаем зависимости
# --no-cache-dir уменьшает размер образа, удаляя временные файлы установки
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем всё содержимое текущей папки в контейнер
COPY . .

# 6. Указываем порт, который будет слушать приложение
EXPOSE 5000

# 7. Запускаем приложение
# Флаг -u (unbuffered) нужен, чтобы логи сразу отображались в Jenkins/Docker
CMD ["python", "-u", "hw.py"]
